04_OpenFoam/_Tut_02/OpenFOAM-14/incompressibleVoF/propeller/system/functions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      functions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#includeFunc patchSurface(patch="propeller.*")
#includeFunc isoSurface(isoField=alpha.water, isoValue=0.5, writeEmpty=true)

// ************************************************************************* //
